{
  "intro": "People say I talk a lot 🤷‍♂️. I love programming 🖥, travelling 🚂, exploring new places 🌍, new cuisines 🍜, and music 🎶",
  "end": "Appreciate your valuable time, if you have anything to say feel free to drop a message. I really like people who tell jokes and talk about science.",
  "careerInfo": [
     {
      "time": "Jan, 2021",
      "company": "eBay Classifieds Group",
      "Type": "Job",
      "Description": "",
      "title": "Site Reliability Engineer"
    },
    {
      "time": "Nov, 2018",
      "company": "Transforming Systems",
      "Type": "Job",
      "Description": "As a DevOps Lead, I work and build my own Kubernetes Clusters. Love manipulating and working with HAProxy. Kubernetes, Terraform, Ansible, HAProxy, Python, Go, Shell are my favorites",
      "title": "DevOps Lead"
    },
    {
      "time": "Feb, 2018",
      "company": "Transforming Systems",
      "Type": "Job",
      "Description": "As a polyglot developer, I help the organisation to co-design and develop many real-time systems and services to NHS partners. Currently, the development provides intelligence systems based on real-time data for 26 CCGs across England, covering multiple providers including primary care, acute hospitals, 111, ambulance services, secondary care, etc. Technologies involved in the project development are Spring Boot, Angular, Mongo, MySQL, NodeJS, Mobile application development, Devops etc.",
      "title": "Polyglot Developer"
    },
    {
      "time": "Mar, 2015",
      "company": "Startups",
      "Type": "Job",
      "Description": "It was okay, made some money helped me to fund my startups for an extent, along with my masters fee.",
      "title": "Released Second Game iOS only."
    },
    {
      "time": "Aug, 2014",
      "company": "Startups",
      "Type": "Job",
      "Description": "A failed attempt to create a money generation model for my startups.",
      "title": "Released First Game."
    },
    {
      "time": "Jun, 2014",
      "company": "Startups",
      "Type": "Job",
      "Description": "Worked on several ideas involving iOS application development, Android application development, Restful API, NodeJS, NoSQL, MySQL, Artificial Intelligence, Web Spider using Python and AWS.",
      "title": "Software Engineer"
    },
    {
      "time": "Mar, 2012",
      "company": "Tata Consultancy Services",
      "Type": "Job",
      "Description": "Worked as a Mainframe programmer for American Express, handling several projects in relation to different geographic locations.",
      "title": "Systems Engineer"
    },
    {
      "time": "Jun, 2011",
      "company": "CVR College of Engineering",
      "Type": "Student",
      "Description": "Graduated with a Bachelors degree in the field of Electronics and Communication Engineering from Jawaharlal Nehru Institute of Technology Hyderabad",
      "title": "Graduated (Bachelors)"
    }
  ],
  "projectInfo": [
    {
      "url": "https://github.com/TejaBeta/kubectl-istiolog",
      "title": "kubectl-istiolog a tiny kubectl plugin to manipulate istio-proxy logging level without istioctl."
    },
    {
      "url": "https://github.com/TejaBeta/release-stats",
      "title": "release-stats a tiny module to check github release stats."
    },
    {
      "url": "https://github.com/TejaBeta/kubectl-ttl",
      "title": "kubectl-ttl is a kubectl plugin to add time to live option to Kubernetes resources."
    },
    {
      "url": "https://github.com/TejaBeta/kopy",
      "title": "Kopy is a kubectl plugin to copy resources from one context to another."
    }
  ],

  "techStack": {
    "languages": [
      "GoLang",
      "Shellscript",
      "Python",
      "TypeScript"
    ],
    "technologies": [
      "Kubernetes",
      "Docker",
      "Terraform",
      "Ansible",
      "GCP",
      "AWS",
      "Azure",
      "OpenStack"
    ]
  }
}
